In [61]:
import numpy as np
import pandas as pd

# serijos

In [62]:
labels = ["x", "y", "z"]
data = [20, 30, 40]
pd.Series(data=data, index=labels)

x    20
y    30
z    40
dtype: int64

In [63]:
zodynas = {"a":1, "b": 2, "c": 3, "d": 4, "e": 5}
pd.Series(data=zodynas)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [64]:
serija = pd.Series([1,2,3,4,5], ["Vilnius", "Kaunas","Klaipeda","Panevezys", "Siauliai"])

In [65]:
serija["Panevezys"]

4

In [66]:
serija2 = pd.Series([1,2,3,4,5], ["Vilnius", "Kaunas","Utena","Siauliai", "Klaipeda"] )
serija

Vilnius      1
Kaunas       2
Klaipeda     3
Panevezys    4
Siauliai     5
dtype: int64

In [67]:
(serija + serija2)

Kaunas       4.0
Klaipeda     8.0
Panevezys    NaN
Siauliai     9.0
Utena        NaN
Vilnius      2.0
dtype: float64

# dataframes

In [68]:
df = pd.DataFrame(
    np.random.randint(0, 100, 30). reshape(5, 6),
    ["a", "b", "c", "d", "e"],
    ["U", "V", "W", "X", "Y", "Z"],
)
df

    U   V   W   X   Y   Z
a  73  39  27  82  19  17
b  18  19  74  50  33   1
c  52  21   9  51  54  20
d  72  16  19  78  69  28
e  67  29  19  14  82   3

In [69]:
df[["U", "X"]]

    U   X
a  73  82
b  18  50
c  52  51
d  72  78
e  67  14

In [70]:
df["U"]

a    73
b    18
c    52
d    72
e    67
Name: U, dtype: int32

In [71]:
df["Naujas"] = [x for x in np.random.randint(0, 100, 5)] # sukuriam nauja stulpeli
df

    U   V   W   X   Y   Z  Naujas
a  73  39  27  82  19  17      34
b  18  19  74  50  33   1       8
c  52  21   9  51  54  20      97
d  72  16  19  78  69  28      89
e  67  29  19  14  82   3      37

In [ ]:
dfr = df.drop("Naujas", axis=1) #reikia naujo kintamojo
dfr

In [73]:
df.drop("Naujas", axis=1, inplace=True) #esamamjam reikia inplace, be naujo kintamojo
df

    U   V   W   X   Y   Z
a  73  39  27  82  19  17
b  18  19  74  50  33   1
c  52  21   9  51  54  20
d  72  16  19  78  69  28
e  67  29  19  14  82   3

In [74]:
df.drop("b") # isima eilute, bet reikiamissaugoti kintamajam jeigu norim kad visai dingtu

    U   V   W   X   Y   Z
a  73  39  27  82  19  17
c  52  21   9  51  54  20
d  72  16  19  78  69  28
e  67  29  19  14  82   3

In [75]:
df.loc["c"]

U    52
V    21
W     9
X    51
Y    54
Z    20
Name: c, dtype: int32

In [76]:
df.iloc[2]

U    52
V    21
W     9
X    51
Y    54
Z    20
Name: c, dtype: int32

In [77]:
df.loc[["a", "b", "e"]]

    U   V   W   X   Y   Z
a  73  39  27  82  19  17
b  18  19  74  50  33   1
e  67  29  19  14  82   3

In [78]:
df.loc["a", "X"]

82

In [79]:
df.loc[["a", "b", "e"], ["V", "X", "Z"]]

    V   X   Z
a  39  82  17
b  19  50   1
e  29  14   3

In [80]:
df.loc["a":"c", "V":"Y"]

    V   W   X   Y
a  39  27  82  19
b  19  74  50  33
c  21   9  51  54

In [81]:
df.iloc[::-1, ::-2]

    Z   X   V
e   3  14  29
d  28  78  16
c  20  51  21
b   1  50  19
a  17  82  39

# filtravimas

In [82]:
df[df>50]

      U   V     W     X     Y   Z
a  73.0 NaN   NaN  82.0   NaN NaN
b   NaN NaN  74.0   NaN   NaN NaN
c  52.0 NaN   NaN  51.0  54.0 NaN
d  72.0 NaN   NaN  78.0  69.0 NaN
e  67.0 NaN   NaN   NaN  82.0 NaN

In [83]:
df

    U   V   W   X   Y   Z
a  73  39  27  82  19  17
b  18  19  74  50  33   1
c  52  21   9  51  54  20
d  72  16  19  78  69  28
e  67  29  19  14  82   3

In [92]:

df[df["X"]>50][["X", "Y", "Z"]]  #pirmi sklaisutai - filtras, antri skliaustai slaisinimas

    X   Y   Z
a  82  19  17
c  51  54  20
d  78  69  28

In [96]:
dfr = df[df["X"]>50]
dfr[["X", "Y", "Z"]]

    X   Y   Z
a  82  19  17
c  51  54  20
d  78  69  28

In [98]:
dfr.loc["c", ["Z", "Y"]]

Z    20
Y    54
Name: c, dtype: int32

In [ ]:
dtr = pd.DataFrame(
    np.random.randint(0, 100, 30). reshape(5, 6),
    ["a", "b", "c", "d", "e"],
    ["U", "V", "W", "X", "Y", "Z"],
) 
dtr

# combo salygos

In [116]:
df

    U   V   W   X   Y   Z
a  73  39  27  82  19  17
b  18  19  74  50  33   1
c  52  21   9  51  54  20
d  72  16  19  78  69  28
e  67  29  19  14  82   3

In [118]:
df[(df["X"] > 40) & (df["Z"]<= 70)]

    U   V   W   X   Y   Z
a  73  39  27  82  19  17
b  18  19  74  50  33   1
c  52  21   9  51  54  20
d  72  16  19  78  69  28

In [119]:
df[(df["X"] > 40) & (df["Z"]<= 70)][["U", "V"]] # and salyga, kaip su C kalba

    U   V
a  73  39
b  18  19
c  52  21
d  72  16

In [132]:
df[(df["W"] > 20) | (df["Y"] < 20)]

    U   V   W   X   Y   Z
a  73  39  27  82  19  17
b  18  19  74  50  33   1

# operacijos su indexais

In [133]:
df.reset_index()

  index   U   V   W   X   Y   Z
0     a  73  39  27  82  19  17
1     b  18  19  74  50  33   1
2     c  52  21   9  51  54  20
3     d  72  16  19  78  69  28
4     e  67  29  19  14  82   3

In [134]:
df

    U   V   W   X   Y   Z
a  73  39  27  82  19  17
b  18  19  74  50  33   1
c  52  21   9  51  54  20
d  72  16  19  78  69  28
e  67  29  19  14  82   3

In [135]:
new_index = "Vilnius Kaunas Klaipeda Panevezys Siauliai".split()
new_index

['Vilnius', 'Kaunas', 'Klaipeda', 'Panevezys', 'Siauliai']

In [142]:
df["Miestai"] = new_index
df

            U   V   W   X   Y   Z    Miestai
Miestai
Vilnius    73  39  27  82  19  17    Vilnius
Kaunas     18  19  74  50  33   1     Kaunas
Klaipeda   52  21   9  51  54  20   Klaipeda
Panevezys  72  16  19  78  69  28  Panevezys
Siauliai   67  29  19  14  82   3   Siauliai

In [143]:
df.set_index("Miestai", inplace=True) # su inplace issaugojam

In [139]:
df

            U   V   W   X   Y   Z
Miestai
Vilnius    73  39  27  82  19  17
Kaunas     18  19  74  50  33   1
Klaipeda   52  21   9  51  54  20
Panevezys  72  16  19  78  69  28
Siauliai   67  29  19  14  82   3